SwaraLinkTechnologies/swl_periph/platform/nrf52832_nrf5_sdk_17.0.2/swl/nordic_example_swl_periph/main.c
// File: main.c
// Copyright (c) 2021, SwaraLink Technologies
// All Rights Reserved
// Licensed by SwaraLink Technologies, subject to terms of Software License Agreement

// Note: the contents of this file are derived from source code written by
// Nordic Semiconductor. The original Nordic license header and copyright notice
// are included below



/**
 * Copyright (c) 2015 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/**
 * @brief Nordic Example SWL Peripheral Application main file.
 *
 * This file contains the source code for a sample server application using the LED Button service.
 */

// C standard library header files
#include <stdint.h>
#include <string.h>

// Board file
#include "boards.h"

// Nordic libraries
#include "nrf.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_crypto.h"
#include "nrf_delay.h"
#include "app_timer.h"
#include "app_button.h"
#include "app_error.h"
#include "nordic_common.h"
#include "sdk_errors.h"
#include "app_scheduler.h"
#if defined(SOFTDEVICE_PRESENT) && SOFTDEVICE_PRESENT
#include "nrf_sdm.h"
#endif

// SWL Peripheral Application Configuration - Modify this file for build-time configuration
#include "swl_periph_app_config.h"

// SWL Peripheral Library Includes
#include "swl_periph.h"
#include "swl_periph_config.h"
#include "swl_periph_nrf_52.h"
#include "swl_periph_demo.h"

#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SWL_PAIRING_TIMEOUT_DEFAULT     120         // 120 seconds pairing timeout

#define SWL_BUTTON_1                     BSP_BUTTON_0   
#define SWL_BUTTON_2                     BSP_BUTTON_1
#define SWL_BUTTON_3                     BSP_BUTTON_2
#define SWL_BUTTON_4                     BSP_BUTTON_3

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                     /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

// Scheduler settings. Values can be increased if needed, but should not be reduced.
#define SCHED_MAX_EVENT_DATA_SIZE   (sizeof(ble_evt_t) + sizeof(ble_evt_hdr_t) + NRF_SDH_BLE_GATT_MAX_MTU_SIZE)
#define SCHED_QUEUE_SIZE            25

//Records the # of times the demo 4k file needs to be sent.
//Wait until full 4k file is sent to another.
static uint8 data_tx_count = 0;

// Bool to track whether data is being sent by copy or reference.
static bool data_sent_by_copy;

// Bool to track whether data being sent requires an acknowledgement
static bool ack_required = false;

// Array for pass by copy file transfer demo.
const uint8 test_array[64] = { 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,
                               23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,
                               42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,
                               61,62,63,64 };

static bool ble_connection_established = false;

//Used to tell whether we are in pairing mode
static bool in_pairing_mode = false;

//Tracks the current power mode.
static swl_pwr_mode_t current_spm;

static void handle_rx_data(const swl_c2p_data_t * p_data);
void dump_diagnostic_log(void);

uint8 test_c2p_array[MAX_RX_PAYLOAD_SIZE] = {0};

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


// Custom declaration of app_error_fault_handler, overwrites the default declaration.
// Function is called due to APP_ERROR_CHECK() not due to SWL Library
void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
    // Error has occurred
    NRF_LOG_INFO("Error has occurred!");
    NRF_LOG_INFO("Error ID: %u", id);
    NRF_LOG_INFO("Error PC: %u", pc);
    NRF_LOG_INFO("Error Info: %u", info);

    __disable_irq();
    NRF_LOG_FINAL_FLUSH();

