SwaraLinkTechnologies/swl_periph/platform/nrf52832_nrf5_sdk_17.0.2/swl/nordic_example_swl_periph/main.c
    switch (id)
    {
        case NRF_FAULT_ID_SD_ASSERT:
            NRF_LOG_ERROR("SOFTDEVICE: ASSERTION FAILED");
            break;

        case NRF_FAULT_ID_APP_MEMACC:
            NRF_LOG_ERROR("SOFTDEVICE: INVALID MEMORY ACCESS");
            break;

        case NRF_FAULT_ID_SDK_ASSERT:
            {
                assert_info_t * p_info = (assert_info_t *)info;
                NRF_LOG_ERROR("ASSERTION FAILED at %s:%u",
                              p_info->p_file_name,
                              p_info->line_num);
            }
            break;

        case NRF_FAULT_ID_SDK_ERROR:
            {
                error_info_t * p_info = (error_info_t *)info;
                NRF_LOG_ERROR("ERROR 0x%08x [%s] at %s:%u\r\nPC at: 0x%08x",
                              p_info->err_code,
                              nrf_strerror_get(p_info->err_code),
                              p_info->p_file_name,
                              p_info->line_num,
                              pc);
                 NRF_LOG_ERROR("End of error report");
            }
            break;

        default:
            NRF_LOG_ERROR("UNKNOWN FAULT at 0x%08X", pc);
            break;
    }

    // retrieve and print out swl_periph diagnostic log raw data
    dump_diagnostic_log();

    // Trigger breakpoint if debugger is connected
    SWL_BKPT;

    // it is recommend to soft reset the system as it may be in an unreliable state due to the unknown error
    sd_nvic_SystemReset();

    // infinite loop; code should never reach here
    for(;;)
    {}
}

static void swl_periph_process_stack_evt(void * p_event_data, uint16_t event_size)
{
  //Do not modify
  //forward BLE stack events to the swl_periph event handler
  swl_periph_nrf_process_stack_evt(p_event_data);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
  //DO NOT MODIFY

  //Put BLE stack event into scheduler for processing
  app_sched_event_put(p_ble_evt, sizeof(ble_evt_t), swl_periph_process_stack_evt);
}

static void periph_evt_handler(swl_periph_evt_t evt, const swl_periph_evt_data_t * p_evt_data)
{
  swl_err_t err_code;

  NRF_LOG_INFO("App Event: %u", (uint8)evt);

  // process events
  switch(evt)
  {
    case SWL_PERIPH_EVT_CONN_ESTABLISHED:
      NRF_LOG_INFO("Device ID: %u", p_evt_data->conn_establish.device_id);
      bsp_board_led_on(BSP_BOARD_LED_0);
      ble_connection_established = true;
      break;

    case SWL_PERIPH_EVT_CONN_TERMINATED:
      NRF_LOG_INFO("Device ID: %u", p_evt_data->conn_terminate.device_id);
      ble_connection_established = false;

      bsp_board_led_off(BSP_BOARD_LED_0);
      break;

    case SWL_PERIPH_EVT_RX_DATA:
      // send back whatever was received
      handle_rx_data(&p_evt_data->c2p_data);
      break;

    case SWL_PERIPH_EVT_DATA_ACK:
      //data was acknowledged by peer device.
      NRF_LOG_INFO("Major: %u Minor: %u", p_evt_data->data_info.id_hdr_major, p_evt_data->data_info.id_hdr_minor);
      break;

    case SWL_PERIPH_EVT_DATA_SENT:
      //Event generated when data transfer has been completely queued up by the Bluetooth stack
      //Additional data can be queued up once this event is recieved.

      NRF_LOG_INFO("Major: %u Minor: %u", p_evt_data->data_info.id_hdr_major, p_evt_data->data_info.id_hdr_minor);

      // are there any pending transmits?
      if(data_tx_count > 0)
      {
        data_tx_count--;

        //Check whether data is being sent by copy or reference.
        if(data_sent_by_copy)
        {
          err_code = swl_periph_p2c_tx_by_copy(test_array, sizeof(test_array), ack_required, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_COPY_NO_ACK);
          SWL_ERROR_CHECK(err_code);
        }
        else
        {
          err_code = swl_periph_p2c_tx_by_ref(demofile_array, DEMOFILE_SIZE, ack_required, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_REF_NO_ACK);
          SWL_ERROR_CHECK(err_code);
        } 
       
        
      }
      break;

    case SWL_PERIPH_EVT_PWR_MODE_UPDATE:
      //Power mode has been successfully changed
      break;

    case SWL_PERIPH_EVT_PWR_MODE_UPDATE_REQUEST:
      //Request to change power mode has be recieved.
      break;

    case SWL_PERIPH_EVT_PAIRING_MODE_EXITED:
      //Event generated when pairing mode has exited
       NRF_LOG_INFO("Device ID: %u Reason: %u", p_evt_data->pairing_mode_exited.device_id, p_evt_data->pairing_mode_exited.swl_pairing_mode);
       
       //Check whether this event was generated because the pairing mode timer expired.
       if((p_evt_data->pairing_mode_exited.swl_pairing_mode == SWL_PAIRING_MODE_TIMER_EXPIRED) &&
          (ble_connection_established == false) )
       {
       }

       in_pairing_mode = false;

       bsp_board_led_off(BSP_BOARD_LED_1);

      break;

    case SWL_PERIPH_EVT_PERIPH_PRIO_UPDATE:
      //Peripheral Priorities have been updated.
      NRF_LOG_INFO("Priority 1: %u, Priority 2: %u, Priority 3: %u", p_evt_data->periph_prio_updated.priority_1, p_evt_data->periph_prio_updated.priority_2, p_evt_data->periph_prio_updated.priority_3);
    
      break;

    case SWL_PERIPH_EVT_PERIPH_PRIO_UPDATE_REQUEST:
      //Peripheral Priority update has been recieved.
      NRF_LOG_INFO("Peripheral Priorities request has been recieved.\n");
      break;

    case SWL_PERIPH_EVT_SYS_STATE_UPDATE:
      //System state has been updated.
      NRF_LOG_INFO("System state has been changed!\n");
      break;

    default:
      // unexpected event;
      break;
  }
}

static void handle_rx_data(const swl_c2p_data_t * p_rx_data)
{
  swl_err_t err_code;
  uint8 id_hdr_maj = p_rx_data->id_hdr_major;
  uint8 id_hdr_min = p_rx_data->id_hdr_minor;
  uint16 rx_data_len = p_rx_data->len;

  memcpy(test_c2p_array, p_rx_data->p_data, p_rx_data->len);

  // SWL demo commands all have id_hdr_maj value of ID_HDR_MAJ_P2C_DEMO_REQ
  // and have a 1-byte payload

  NRF_LOG_INFO("Data Recieved!!\n");
  NRF_LOG_INFO("Len: %u, Maj ID: %u, Min ID %u, Payload First Byte: %u\n", rx_data_len, id_hdr_maj, id_hdr_min, p_rx_data->p_data[0]);

