SwaraLinkTechnologies/swl_periph/platform/nrf52832_nrf5_sdk_17.0.2/swl/nordic_example_swl_periph/main.c
  if((p_rx_data->id_hdr_major == ID_HDR_MAJ_P2C_DEMO_REQ) && (rx_data_len == 1))
  {
    // this was a demo req; process based on id_hdr_min value
    

    switch(id_hdr_min)
    {
      case ID_HDR_MIN_P2C_DEMO_REQ_TX_BY_REF_NO_ACK:        
        {
          // queue up data by reference with no ack(use 4096 byte demofile_array)
          
          // byte 0 of payload is the number of times to repeat the transfer
          uint8 repeat_ct = p_rx_data->p_data[0];
          
          // valid range is 1-100 (if out of range, then ignore command)
          if((repeat_ct >= 1) && (repeat_ct <= 100))
          {
            // valid count
            data_tx_count = repeat_ct;

            data_sent_by_copy = false;

            ack_required = false;

            // decrement count since first transmit has been queued
            data_tx_count--;
            
            // queue up first transfer
            err_code = swl_periph_p2c_tx_by_ref(demofile_array, DEMOFILE_SIZE, false, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_REF_NO_ACK);
            SWL_ERROR_CHECK(err_code);
          }
        }
        break;

      case ID_HDR_MIN_P2C_DEMO_REQ_TX_BY_COPY_NO_ACK:
        {
          // queue up data by copy with no ack (use 64-byte data packet)
          
          // byte 0 of payload is the number of times to repeat the transfer
          uint8 repeat_ct = p_rx_data->p_data[0];

          // valid range is 1-100 (if out of range, then ignore command)
          if((repeat_ct >= 1) && (repeat_ct <= 100))
          {
            // valid count
            data_tx_count = repeat_ct;

            data_sent_by_copy = true;

            ack_required = false;

            // decrement count since first transmit has been queued
            data_tx_count--;

            // queue up first transfer
            err_code = swl_periph_p2c_tx_by_copy(test_array, sizeof(test_array), false, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_COPY_NO_ACK);
            SWL_ERROR_CHECK(err_code);
          }
        }
        break;

      case ID_HDR_MIN_P2C_DEMO_REQ_TX_BY_REF_ACK:        
        {
          // queue up data by reference with ack (use 4096 byte demofile_array)
          
          // byte 0 of payload is the number of times to repeat the transfer
          uint8 repeat_ct = p_rx_data->p_data[0];
          
          // valid range is 1-100 (if out of range, then ignore command)
          if((repeat_ct >= 1) && (repeat_ct <= 100))
          {
            // valid count
            data_tx_count = repeat_ct;

            data_sent_by_copy = false;

            ack_required = true;

            // decrement count since first transmit has been queued
            data_tx_count--;
            
            // queue up first transfer
            err_code = swl_periph_p2c_tx_by_ref(demofile_array, DEMOFILE_SIZE, true, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_REF_ACK);
            SWL_ERROR_CHECK(err_code); 
          }
        }
        break;

      case ID_HDR_MIN_P2C_DEMO_REQ_TX_BY_COPY_ACK:
        {
          // queue up data by copy with ack (use 64-byte data packet)
          
          // byte 0 of payload is the number of times to repeat the transfer
          uint8 repeat_ct = p_rx_data->p_data[0];

          // valid range is 1-100 (if out of range, then ignore command)
          if((repeat_ct >= 1) && (repeat_ct <= 100))
          {
            // valid count
            data_tx_count = repeat_ct;

            data_sent_by_copy = true;

            ack_required = true;

            // decrement count since first transmit has been queued
            data_tx_count--;

            // queue up first transfer
            err_code = swl_periph_p2c_tx_by_copy(test_array, sizeof(test_array), true, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_COPY_ACK);
            SWL_ERROR_CHECK(err_code);
          }
        }
        break;

      default:
        //Do nothing
        break;
    }
  }
}


void dump_diagnostic_log(void)
{
    uint8 * p_diag_log;

   // retrieve diagnostic log
    swl_periph_get_diagnostic_log(&p_diag_log);
    
    if(p_diag_log != NULL)
    {
        uint16 i = 0;
        NRF_LOG_INFO("SwaraLink Peripheral Middleware - Diagnostic log dump:");

        // print out diagnostic log raw data, in chunks of 3 bytes:
        while(i < SWL_PERIPH_DIAGNOSTICS_LOG_BUFFER_SIZE)
        {
            // print bytes from diagnostic log
            NRF_LOG_INFO("index: %04d, type: %02x id: %04x", i, *p_diag_log, *((uint16*)(p_diag_log+1)) );
            i = i + 3;
            p_diag_log = p_diag_log + 3;

            // 1ms delay to allow time for RTT logging to complete
            nrf_delay_ms(1);
        }



    }
    else
    {
        NRF_LOG_INFO("SwaraLink Peripheral Middleware - Diagnostic log not found!");
    }
}

void exception_handler(const swl_periph_exception_data_t * p_exception_data)
{
    // exception occurred in swl_periph library 
    
    if(p_exception_data != NULL)
    {    
        NRF_LOG_INFO("swl_periph exception occurred! Please take note of the following information and report to SwaraLink Technologies:");
        NRF_LOG_INFO("Exception filename code:      %02x", p_exception_data->filename_code);
        NRF_LOG_INFO("Exception line number:        %u", p_exception_data->line_number);
        NRF_LOG_INFO("Exception metadata A:         %08x", p_exception_data->metadata_a);
        NRF_LOG_INFO("Exception metadata B:         %08x", p_exception_data->metadata_b);
    }

    // retrieve and print out diagnostic log raw data
    dump_diagnostic_log();

    // Trigger breakpoint if debugger is connected
    SWL_BKPT;

    // for in-field exceptions, it is recommend to soft reset the system as the swl_periph library may be in an unreliable state
    sd_nvic_SystemReset();

    // infinite loop; code should never reach here
    for(;;)
    {}
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{   
    swl_periph_nrf_process_idle_state();

    //Process events in app scheduler queue.
    app_sched_execute();

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    swl_err_t err_code;

