SwaraLinkTechnologies/swl_periph/platform/nrf52832_nrf5_sdk_17.0.2/swl/nordic_example_swl_periph/main.c
    switch (pin_no)
    {
        case SWL_BUTTON_1:
        {
          //Check whether button_action has been pressed down
          if(button_action)
          {
            //Check whether we are in pairing mode.
            if(!in_pairing_mode)
            {
              NRF_LOG_INFO("Entering SWL Pairing Mode!!!");

              //We are not in pairing mode. Enter pairing mode.
              err_code = swl_periph_enter_pairing_mode(SWL_PAIRING_TIMEOUT_DEFAULT);
              SWL_ERROR_CHECK(err_code);

              in_pairing_mode = true;

              bsp_board_led_on(BSP_BOARD_LED_1);
            }

            else
            {
              NRF_LOG_INFO("Exiting SWL Pairing Mode!!!");

              //We are currently in pairing mode. Exit pairing mode.
              err_code = swl_periph_exit_pairing_mode();
              SWL_ERROR_CHECK(err_code);
            }
          }
        }
            break;

        case SWL_BUTTON_2:
          if(button_action)
          {
            NRF_LOG_INFO("Factory Reset!");

            err_code = swl_periph_perform_factory_reset();
            SWL_ERROR_CHECK(err_code);
          }
            break;
         
         case SWL_BUTTON_3:
          if(button_action)
          {
          }
            break;

         case SWL_BUTTON_4:
          if(button_action)
          {
            //Check if connection has been established.
            if(ble_connection_established)
            {

              //Send a 4k file
              err_code = swl_periph_p2c_tx_by_ref(demofile_array, DEMOFILE_SIZE, ack_required, ID_HDR_MAJ_P2C_DEMO_RSP, ID_HDR_MIN_P2C_DEMO_RSP_TX_BY_REF_NO_ACK);
              SWL_ERROR_CHECK(err_code);
            }
          }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}

static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    SWL_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

//Optional. Used for demo purposes.
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}

//Optional. Function for initializing the button handler module.
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {BUTTON_1, false, BUTTON_PULL, button_event_handler},
        {BUTTON_2, false, BUTTON_PULL, button_event_handler},
        {BUTTON_3, false, BUTTON_PULL, button_event_handler},
        {BUTTON_4, false, BUTTON_PULL, button_event_handler}

    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}

static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


static void initialize_swl_periph_middleware(void)
{
    ret_code_t err_code;
    swl_err_t  swl_err_code;

    // Initialize app_timer module
    // The app_timer module is required by the SwaraLink Peripheral middleware. It can 
    // also be used by the application; however, the application must ensure that it
    // does not interfere with the operation of any timers that it did not create.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Initialize Nordic's crypto library
    // The nrf_crypto module is required by the SwaraLink Peripheral middleware. It can
    // also can be used by the application; however the application must not 
    // uninitialize it at any time.
    err_code = nrf_crypto_init();
    APP_ERROR_CHECK(err_code);

    // Configure buffers for the SwaraLink Peripheral middleware
    // (error response is checked using standard Nordic APP_ERROR_CHECK macro
    // since the swl_periph exception handler has not yet been registered)
    swl_err_code = swl_periph_config();
    APP_ERROR_CHECK(swl_err_code);

    //Init app scheduler
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);

    // Initialize SwaraLink peripheral module; register event handlers
    swl_err_code = swl_periph_init(periph_evt_handler, exception_handler);
    SWL_ERROR_CHECK(swl_err_code);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    log_init();
    leds_init();
    power_management_init();
    buttons_init();

    app_button_enable();

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    initialize_swl_periph_middleware();

    // Start execution.
    NRF_LOG_INFO("SWL Periph Example started!");

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
